**`commonimages/base/rhel_6_10`** terragrunt plan on `pull_request` event [#210](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 3s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["stig_rhel6_ansible.yml.tftpl"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-rhel-6-10"
        name         = "base_rhel_6_10"
        tags         = {
            "application"                               = "n/a"
            "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "image-pipeline"                            = "base_rhel_6_10"
            "image-recipe"                              = "base_rhel_6_10/0.0.8"
            "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
            "is-production"                             = "true"
            "os-version"                                = "rhel 6.10"
            "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                          = "n/a"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
            "update-linux-version"                      = "1.0.2"
        }
        # (5 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "shared rhel 6.10 base image"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-rhel-6-10"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-6-10-0-0-8"
      + name                             = "base_rhel_6_10"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                               = "n/a"
          + "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "image-pipeline"                            = "base_rhel_6_10"
          + "image-recipe"                              = "base_rhel_6_10/0.0.8"
          + "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
          + "is-production"                             = "true"
          + "os-version"                                = "rhel 6.10"
          + "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                          = "n/a"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
          + "update-linux-version"                      = "1.0.2"
        }
      + tags_all                         = {
          + "application"                               = "n/a"
          + "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "image-pipeline"                            = "base_rhel_6_10"
          + "image-recipe"                              = "base_rhel_6_10/0.0.8"
          + "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
          + "is-production"                             = "true"
          + "os-version"                                = "rhel 6.10"
          + "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                          = "n/a"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
          + "update-linux-version"                      = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 1 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.0.8" -> (known after apply)
      ~ date_created     = "2023-03-17T10:11:57.090Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.0.8" -> (known after apply)
        name             = "base_rhel_6_10"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-095f71fce81c09b79" -> "ami-023a539e6d65fa54b" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
        tags             = {
            "application"                               = "n/a"
            "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "image-pipeline"                            = "base_rhel_6_10"
            "image-recipe"                              = "base_rhel_6_10/0.0.8"
            "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
            "is-production"                             = "true"
            "os-version"                                = "rhel 6.10"
            "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                          = "n/a"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
            "update-linux-version"                      = "1.0.2"
        }
        # (4 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

```
